app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("description", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "l;fjsdklfjlkjflfkasfs"], ["post_id", 2], ["created_at", "2019-07-09 02:04:48.325040"], ["updated_at", "2019-07-09 02:04:48.325040"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" ASC  [["post_id", 2]]
---
    def create

        @post = Post.find(params[:post_id])
        @comment = Comment.new (comment_params)
        @comment.post = @post
        if @comment.save
        redirect_to posts_path

        else

        @comments = @post.comments.order(created_at: :ASC)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2052], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2052]]
---
    def destroy
        @comment = Comment.find params[:id]

            @comment.destroy