app/controllers/posts_controller.rb

  def show
    @comment = Comment.new


    @comments = @post.comments.order(created_at: :desc)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", 2]]

    def destroy
      flash[:notice] = "Post destoryed!"
      @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]

    def find_post
      @post = Post.find params[:id]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]